<!DOCTYPE html>
<html lang="sv" >
    <head>
            <meta charset="utf-8">
            <meta name="viewport" content ="width=device-width">
            <meta name="decription" content="Index for github pages"> 
            <meta name="keywords" content="github, jonatan vahlberg, github pages, student,html">
            <meta name="author" content="Jonatan Vahlberg">
            <title>Samsons Parking |Info</title>
            <link rel="stylesheet" type="text/css" href= "design.css">
            <link href="https://fonts.googleapis.com/css?family=Montserrat" rel="stylesheet">
            <link href="https://fonts.googleapis.com/css?family=Black+Ops+One" rel="stylesheet">
            <link href="https://fonts.googleapis.com/css?family=Raleway" rel="stylesheet">    
    </head>

    <body>
        <header>
            <h2>Samsons Parking</h2>
            
            <nav>

                    <div><a class="current" href="./index.html">Hem</a></div>
                    <div><a href="./booking.html">Bokning</a></div>
                    <div><a href="./service.html">Tjänster</a></div>
                    <div><a href="./directions.html">Hitta Hit</a></div>
                    <div><a href="./contact.html">Kontakt</a></div>
                
            </nav>
        </header>
        
        <section id="infoSection">
            <h1>Samsons Deluxe Parkning</h1>
            <p>Parkering i stockholms innerstad för lite finare kunder</p>
        </section>
        
        <article class="infoArt" >
            <h1 class="western" lang="sv-SE">Till Leo Samson</h1>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Hej Leo jag hoppas att du har hunnit v&auml;nja dig vid hemsidan vid det h&auml;r laget. Jag har f&ouml;rs&ouml;kt att g&ouml;ra allting efter vad som f&ouml;rv&auml;ntades h&auml;r nedan har jag listat vikitg info som kan beh&ouml;vas i framtiden.</p>
            <ul>
            <li>
            <p lang="sv-SE">F&auml;rgschema</p>
            <ul>
            <li>
            <p lang="sv-SE" id="blue">#49198b &ndash; M&ouml;rkbl&aring;</p>
            </li>
            <li>
            <p lang="sv-SE" id="red" >#800020 &ndash; vinr&ouml;d</p>
            </li>
            <li>
            <p lang="sv-SE" id="beige">#F4EDC2 &ndash; beige</p>
            </li>
            <li>
            <p lang="sv-SE">svart och vitt</p>
            </li>
            </ul>
            </li>
            <li>
            <p lang="sv-SE">Typsnitt</p>
            <ul>
            <li>
            <p lang="sv-SE" id="rale">Raleway - meny</p>
            </li>
            <li>
            <p lang="sv-SE" id="black">Black ops one - huvud</p>
            </li>
            <li>
            <p lang="sv-SE" id ="mon">Montserrat &ndash; Br&ouml;d text</p>
            </li>
            </ul>
            </li>
            <li>
            <p lang="sv-SE">Verktyg</p>
            <ul>
            <li>
            <p lang="sv-SE">Html5</p>
            </li>
            <li>
            <p lang="sv-SE">CSS3</p>
            </li>
            </ul>
            </li>
            </ul>
            <p lang="sv-SE">Som du kan se s&aring; &auml;r detta v&auml;ldigt basic spr&aring;k och styling men om du vill ha JS funktioner kommer det att kosta lite extra.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">I ditt senaste mail fr&aring;gade du mig om vad skilllnader &auml;r mellan H<strong>ybrid/Native och Web </strong>och vilket jag tycker &auml;r r&auml;tt f&ouml;r dig jag ska f&ouml;rs&ouml;ka svara p&aring; ett s&aring; omfattande vis b&aring;de f&ouml;r och nackdelar med de tre alternativen samt vad du kan f&aring; f&ouml;r funktioner p&aring; det olika platformarna. Vi b&ouml;rjar med web eftersom den &auml;r viktigast just nu.</p>
            <p lang="sv-SE"><br /><br /></p>
            <h2 class="western" lang="sv-SE">Web</h2>
            <p lang="sv-SE">Web &auml;r den absolut mest simpla av de tre... det &auml;r inte n&ouml;dv&auml;ndigtvis en d&aring;lig sak dock.</p>
            <p lang="sv-SE">Posetiva:</p>
            <p lang="sv-SE">Web g&aring;r snabbt att bygga. Det mesta som du kan g&ouml;ra med bara Html och CSS tar inte l&aring;ng tid att skapa och med mallar redan klara s&aring; g&aring;r det &auml;nnu snabbare.</p>
            <p lang="sv-SE">Web kr&auml;ver inte s&aring; h&ouml;g kompetens som det andra. Viserligen m&aring;ste programeraren/web designaren vara duktig p&aring; det den ska g&ouml;ra men HTML och CSS &auml;r v&auml;ldigt simpla och enkla spr&aring;k och kan d&auml;rf&ouml;r byggas av m&aring;nga fler.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Det tredje posetiva &auml;r priset. Det blir MYCKET billigare om man k&ouml;r p&aring; web. Native och hybrid inneb&auml;r mer arbete som oftast &auml;r mer komlicerat och d&auml;rf&ouml;r kan det bli v&auml;ldigt dyrt i j&auml;mf&ouml;relse s&aring; brukar web uppdrag varken kosta s&auml;rskillt mycket tid eller pengar.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">&Aring;tkomstbart alla med en dator eller mobil kan komma &aring;t din sida. Detta betyder ocks&aring; att detblir l&auml;tt att g&ouml;ra snabba ingrepp om n&aring;got saknas eller har blivit fel</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Negativa:</p>
            <p lang="sv-SE">Web &auml;r som sagt <strong>simpelt</strong> v&auml;ldigt mycket blir begr&auml;nsat vi kan undankomma en liten del med PHP eller javaScript men inte mycket. Vi kan inte heller trycka in f&ouml;rmycket JS eftersom en del web anv&auml;ndare har blockerat JS i sin webl&auml;sare och en del web l&auml;sre kan inte hantera vissa element.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Utan server s&auml;kerhet &auml;r web inte s&aring; s&auml;kert och d&auml;rmed kan man absolut inte spara viktig info om kunder utan ett seri&ouml;st s&auml;kerhets system.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Web har inte m&ouml;jligheten att skcika push notiser. Detta &auml;r kanske en liten grej f&ouml;r det mesta men detta g&ouml;r att om du vill f&aring; ut info om kampajer eller liknande m&aring;ste du lita p&aring; mail d&auml;r m&aring;nga kanske inte vill f&aring; reklam men med push notiser kan du snabbt och smidigt medela kunder om tex kampanjer eller lediga tider.</p>
            <p lang="sv-SE">Funktioner:</p>
            <p lang="sv-SE">Man kan g&ouml;ra mycket p&aring; en websida hosta videor, formul&auml;r, kommentarsf&auml;lt/suport, f&aring; updaterad info genom tex en kalender eller liknande men mer komplicerat &auml;n s&aring; blir det inte riktigt</p>
            <h2 class="western" lang="sv-SE">Hybrid</h2>
            <p lang="sv-SE">Det &auml;r inte s&auml;kert att alla vet vad hybrid &auml;r s&aring; jag ska f&ouml;rklara det ocks&aring;. Med Hybrid menar vi att man utvecklar kod f&ouml;r tillexempel Android och IOS(apple) samtidigit tillskillnad fr&aring;n native d&auml;r du utvecklar koden enbart f&ouml;r ett system itaget.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Posetiva:</p>
            <p lang="sv-SE">Det posetiva med Hybrid &auml;r f&ouml;r det f&ouml;rsta att Det blir smidigt att skriva appen mindre s&aring; en web men betydligt mera smidigare &auml;n Native.</p>
            <p lang="sv-SE">Med en hybrid app n&aring;r du ut till m&aring;nga olika platformer och sparar d&auml;rf&ouml;r p&aring; tid (i j&auml;mf&ouml;relse) Det blir l&auml;ttare att uppdatera ocks&aring; eftersom du har bara ett sett av filer som ska fixas enligt en grupp av syntax ist&auml;llet f&ouml;r 2+.</p>
            <p lang="sv-SE">Pushnotiser det &auml;r &auml;nd&aring; en vikitg funktion som l&aring;ses upp fr&aring;n och med hybrid.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Neutralt:</p>
            <p lang="sv-SE">Priset blir h&ouml;gre &auml;n web men l&auml;gre &auml;n Native</p>
            <p lang="sv-SE">Arbetet kommer att ta l&auml;ngre tid men inte lika l&aring;ng tid som native.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Negativt:</p>
            <p lang="sv-SE">Det g&aring;r fortfarande inte att spara viktig kund data eftersom de allraflesta hybrid apparna skickar all sin data till ett amerikanskt f&ouml;retag f&ouml;r granskning och det fungerar d&auml;rf&ouml;r inte med GDPR.</p>
            <p lang="sv-SE">Mycket appst&ouml;d som tex paypal,swich eller bankid &auml;r fullkommligt om&ouml;jligt att integrera i en hybridapp just p&aring; grund av s&auml;kerhet.</p>
            <p lang="sv-SE">Du kommer onekligen att har s&auml;kerhets brister med Hybrid mindre s&aring; en Web myckert mer s&aring; &auml;n Native'</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Funktioner: (m&ouml;jliga fr&aring;n hybrid niv&aring;) Du har nu m&ouml;jlighet till diverse chatt funktioner s&aring; som facebook messeger. P&aring;tala om facebook har du s&auml;kerligen en m&ouml;jlighet att koppla med google eller facebook p&aring; olika s&auml;tt (twittter och liknande instagram &aring;sv)</p>
            <p lang="sv-SE">Du kan ocks&aring; g&ouml;ra mera komplexa formul&auml;r och funktioner. Telefon integration &auml;r ocks&aring; en funktion som l&aring;ses upp om du utvecklar hybridt f&ouml;r Android och IOS . Funktionerna slutar ungef&auml;r vid bankappar eller liknande f&ouml;r det beh&ouml;ver du Native</p>
            <p lang="sv-SE"><br /><br /></p>
            <h2 class="western" lang="sv-SE">Native</h2>
            <p lang="sv-SE">Native &auml;r det slutgiltliga steget h&auml;r b&ouml;rjar man kunna g&ouml;ra riktigt komplicerade funktioner och priset reflekterar ofta detta.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Posetiva:</p>
            <p lang="sv-SE">S&auml;kerheten &auml;r nu mycket h&ouml;gre och med integration fr&aring;n andra s&auml;kerhets appar kan man skapa en riktigt bra s&auml;kerhet.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Skr&auml;ddarsydd. Eftersom vi arbetar med en spesfik platform i taget kan vi skr&auml;ddar sy funktionerna och ibland g&aring; s&aring; djupt som maskinkod om vi vill verkligen grotta ner oss. Oftast skappar denna skr&auml;ddarsydda appen en mera h&auml;rlig style &auml;n de andra alternativen</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Integration. Du har ett bokningssytem nu som baseras p&aring; mail och &rdquo;PHP&rdquo; och det fungerar s&auml;kert som det ska men det &auml;r defenetivt inte optimellt. Tillexempel hitils har det inte varit en m&ouml;jlighet att betala direkt i appen men nu kan vi det integrera en bankprotocol och tex mobiltbankID s&aring; har kunden m&ouml;jlighet att betala if&ouml;rv&auml;g om de s&aring; &ouml;nskar. Eftersom detta kr&auml;ver en viss s&auml;kerhet f&ouml;r att falla in under GDPR regler &auml;r detta endast m&ouml;jligt i Native appar.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Neutralt:</p>
            <p lang="sv-SE">Om du inte har h&ouml;g trafik p&aring; din hemsida s&aring; tror jag inte att det &auml;r v&auml;rt att g&ouml;ra en native app fr&aring;n hemsidan eftersom detmesta fungerar som det ska redan nu. Hybrid kanske men inte native.</p>
            <p lang="sv-SE">Negativt:</p>
            <p lang="sv-SE">Tiden. Det kommer att ta mycket l&auml;ngre tid f&ouml;r att f&aring; ut n&aring;got vettigt som kan anv&auml;ndas. Om du ocks&aring; vill ha den p&aring; sig b&aring;de android och IOS kommer det ta &auml;nnu l&auml;ngre Och med denna tid kommer ocks&aring;...</p>
            <p lang="sv-SE">Priset. Dessa tv&aring; h&aring;nger ihop och det blir en kraftig skillnad i pris mellan web/hybrid och native. &rdquo;tid &auml;r pengar&rdquo; men det blir ocks&aring; pris skillnad i och med att mera kraftiga och ofta dyrare program och kodpaket anv&auml;nds. Samt vi anv&auml;nder oss av dyrare arbetskraft s&aring; allting &ouml;kar i pris hur man &auml;n ser p&aring; det .</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Funktioner:</p>
            <p lang="sv-SE">Som jag redan har sagt s&aring; har man m&ouml;jlighet till ett integrerat betalsystem (paypal bankid &aring;sv) och integrerade appar som calender suport och liknande s&aring; det &auml;r dem funktionerna samt alla tidigare n&auml;mnda som kan anv&auml;ndas p&aring; i en native app. Samt pushnotiser med andra funktioner och integrationer.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE">Det finns s&auml;kert en hel del som jag inte n&auml;mmner nu men detta &auml;r det jag kan komma p&aring; om du har n&aring;gra fr&aring;gor och funderingar h&ouml;r g&auml;rna av dig s&aring; ska vi nog kunna l&ouml;sa dem.</p>
            <p lang="sv-SE"><br /><br /></p>
            <p lang="sv-SE"><em>Med v&auml;nliga h&auml;lsningar Jonatan Vahlberg.</em></p>

        </article>
        
        <footer>
                <p>Samson Deluxe Parking Copyright &copy; 2018<a href="info.html">INFO</a></p>
                <p> Icons Made by <a href="https://www.flaticon.com/authors/monkik">Monkik</a> and <a href="https://www.flaticon.com/authors/freepik">Freepik</a>  from  <a href="https://www.flaticon.com">www.flaticon.com</a></p> 
        </footer>
    
    </body>
</html>